package exam;

public class Ex02 {
	public static void main(String[] args) {
		/*
(1) a는 10 이상이고 30 미만인 값이다. ==> a >= 10 && a < 30
(2) b는 양수이다. ==> b >= 0
(3) c는 홀수이다. ==> c % 2 == 1
(4) num는 5로 나누어 떨어지지 않는다. ==> num % 5 != 0
(5) test는 0이다. ==> test == 0
(6) a는 10과 20 사이의 값이 아니다. ==> (!(a > 10) && !(a < 20)) 
(7) x는 음수가 아니다. ==> !(x < 0)
(8) y에서 10을 빼도 음수가 되지 않는다. ==> (y - 10 < 0) 
(9) i는 3의 배수이다. ==> i % 3 == 0
(10) num는 100 이상이 아니다. ==> !(num >= 100) 
(11) a는 20 이상이거나 10 미만이다. ==> a < 10 || a >= 20
(12) a는 20 이상이 아니다.  ==>  !(a >= 20)
(13) a에서 10을 빼면 양수이다. ==> a - 10 >= 10
(14) num은 양수가 아니다. ==> num < 0
(15) age는 19 이상이다. ==> age >= 19
(16) num은 짝수이다. ==> num % 2 == 0
(17) ch는 영문 대문자이다. ==> ch >= 65 && ch <= 97
					  ==> ch >= 'A' && ch <= 'Z'
(18) number는 숫자이다. ==> number >= 48 && number <= 57
					==> number >= '0' && number <= '9'
(19) avg는 80 이상이고 90 미만이다. ==> avg >= 80 && age < 90 
(20) bmi는 20.0 이상이고 25.0 미만이다. ==> bmi >= 20.0 && bmi < 25.0 

		 */
	}
}
